---
kind: property
id: P:Autodesk.Revit.DB.FamilySymbol.StructuralMaterialType
zh: 族类型、族符号
source: html/e3e95cd1-6fb6-6c08-b8e7-4e5267d7339e.htm
---
# Autodesk.Revit.DB.FamilySymbol.StructuralMaterialType Property

**中文**: 族类型、族符号

This property returns the physical material from which the type is made.

## Syntax (C#)
```csharp
public StructuralMaterialType StructuralMaterialType { get; }
```

## Remarks
Values of this property can be Steel, Concrete, Wood or some other material.